petersieg/ESP32TinyVectrex/ESP32/TinyVectrexJohnHawthorn/TinyVectrex/osint.cpp

// JJ #include "SDL/SDL.h"
#include <math.h>
#include "gbConfig.h"
#include "fabgl.h"
#include "gbGlobals.h"
#include "osd.h"
// JJ #include "SDL_gfxPrimitives.h"

#include "osint.h"
#include "vecx.h"

#ifndef use_lib_wifi
#ifdef use_lib_cartdridge_flash_ram
#include "dataFlash/gbrom.h"
#endif
#endif

// ac{}
#include "FastDac.h"
#include "esp32-hal-cpu.h"
#include <Arduino.h>
#include <driver/dac.h>
#include <soc/rtc.h>
#include <soc/sens_reg.h>

//#ifdef use_lib_rom_no_use_ram
#include "dataFlash/gbbios.h"
//#endif

#include <Arduino.h>
#include "PS2Kbd.h"
#include "PS2KeyCode.h"


#ifdef use_lib_wifi
#include "gbWifi.h"
#include "gbWifiConfig.h"
#endif


#define EMU_TIMER 20 // the emulators heart beats at 20 milliseconds


// char *gb_cartfilename=NULL;
unsigned char gb_load_new_rom = 1;
unsigned char gb_id_cur_rom = 0; // rom actual
// Portar SDL_Event gb_event;
unsigned char gb_salir = 0;
// unsigned char gb_reset=0;

//Portar SDL_Color gb_colors[256]; //paleta sdl 256 colores


// Portar static SDL_Surface *screen = NULL;

#ifdef use_lib_vectortiny
static int screenx;
static int screeny;
static int scl_factor;
static int offx;
static int offy;
#else
static long screenx;
static long screeny;
static long scl_factor;
//static float scl_factor_float;
static long offx;
static long offy;
#endif



//Portar void PreparaPaleta()
//Portar {
//Portar  //Paleta real TTGO VGA32 64 colores
//Portar  for (int j=0;j<4;j++)
//Portar  {
//Portar   for(int i=0;i<64;i++)
//Portar   {
//Portar    gb_colors[i+(j*64)].b=((i>>4)&0x03)*85;
//Portar    gb_colors[i+(j*64)].g=((i>>2)&0x03)*85;
//Portar    gb_colors[i+(j*64)].r=(i & 0x03)*85;
//Portar   }
//Portar  }
//Portar }

//Portar void draw_pixel(SDL_Surface *screen, int x, int y, unsigned char pixel)
//Portar { 
//Portar  Uint8 *bufp = (Uint8 *)screen->pixels + y * screen->w + x;
//Portar  if (x>=0 && x<screenx && y>=0 && y<screeny)
//Portar  {
//Portar   *bufp = pixel;
//Portar  }
//Portar  //else
//Portar  //{
//Portar  // printf("x:%d y:%d\n",x,y);     
//Portar  // fflush(stdout);
//Portar  //}
//Portar }


void swap(int *i, int *j)
{
    int t = *i;
    *i = *j;
    *j = t;
}

void swap_short(short int *i, short int *j)
 {
    short int t = *i;
    *i = *j;
    *j = t;
}


#ifdef use_lib_vectortiny
 //****************************************************************************
//Portar  void jj_aalineRGBA_tiny(SDL_Surface *surface, int x0, int y0, int x1, int y1)
//Portar  {
//Portar   int i;
//Portar   float x = x1 - x0; 
//Portar   float y = y1 - y0;
//Portar   float length = sqrt( x*x + y*y );
//Portar   float addx = x / length;
//Portar   float addy = y / length;
//Portar   x = x0;
//Portar   y = y0;
//Portar   
//Portar   for (int i = 0; i < length; i += 1)
//Portar   {
//Portar    draw_pixel(surface, (int)x, (int)y, 255);
//Portar    x += addx;
//Portar    y += addy;	         
//Portar   }     
//Portar  }
#endif 

//****************************************************************************
//Portar void jj_aalineRGBA(SDL_Surface *surface, int x0, int y0, int x1, int y1, Uint8 r, Uint8 g, Uint8 b, Uint8 a) 
//Portar {
//Portar  unsigned char pixel= (r>0)?255:0;
//Portar  int i;
//Portar  float x = x1 - x0;
//Portar  float y = y1 - y0;
//Portar  float length = sqrt( x*x + y*y );
//Portar  float addx = x / length;
//Portar  float addy = y / length;
//Portar  x = x0;
//Portar  y = y0;
//Portar   
//Portar  for ( i = 0; i < length; i += 1)
//Portar  {
//Portar   draw_pixel(surface, (int)x, (int)y, pixel );
//Portar   x += addx;
//Portar   y += addy;	         
//Portar  }
//Portar }

/*
void jj_aalineRGBA (SDL_Surface *surface, int x1, int y1, int x2, int y2, Uint8 r, Uint8 g, Uint8 b, Uint8 a)
{
 int steep,inc;
 int color= (r+g+b)/3;
 //x1= x1-(495/2);
 //x2= x2-(495/2);
 //y1= y1-(615/2);
 //y2= y2-(615/2);

        // bresenham line

            steep = fabs(y2 - y1) > fabs(x2 - x1),
            inc = -1;

        if (steep) {
                swap(&x1, &y1);
                swap(&x2, &y2);
        }

        if (x1 > x2) {
                swap(&x1,&x2);
                swap(&y1,&y2);
        }

        if (y1 < y2) {
                inc = 1;
        }

        int dx = (int)fabs(x2 - x1);
        int dy = (int)fabs(y2 - y1);
        int y = y1, x = x1;
        int e = 0;

        for (x; x <= x2; x++) {
                if (steep) {
                        draw_pixel(surface, y, x, color);
                } else {
                        draw_pixel(surface, x, y, color);
                }

                if ((e + dy) << 1 < dx) {
                        e = e + dy;
                } else {
                        y += inc;
                        e = e + dy - dx;
                }
        }

}
*/

#ifdef use_lib_remove_fabgl_queue
#ifdef use_lib_wifi
static void Clear_bresenham()
#else
static void IRAM_ATTR Clear_bresenham()
#endif
{
    // uint8_t * ptrVideo;
    int tope = VGAController.getViewPortHeight();
    unsigned char topeByte = (VGAController.getViewPortWidth() >> 3); // DIV 8
    for (unsigned int i = 0; i < tope; i++) {
        // uint8_t* gb_buffer_vga= VGAController.getScanline(i);
        // memset(gb_buffer_vga[i],0,128); //1024 DIV 8
        memset(gb_buffer_vga[i], 0, topeByte); // 1024 DIV 8
        // ptrVideo = (uint8_t *)VGAController.sgetScanline(i);
        // memset(ptrVideo,0,128); //1024 DIV 8
    }
    // memset(gb_buffer_vga[702],0xFF,10);
    // ptrVideo = (uint8_t *)VGAController.sgetScanline(10);
    //  for (int i=0;i<tope;i++)
    //  {
    //   //ptrVideo = (uint8_t *)VGAController.sgetScanline(i);
    //   //memset(ptrVideo,0xFF,10);
    //   memset(gb_buffer_vga[i],0xFF,10);
    //  }
}

#ifdef use_lib_wifi
static void draw_pixel_bresenham(short int x, short int y)
#else
static void IRAM_ATTR draw_pixel_bresenham(short int x, short int y)
#endif
{
  //unsigned short int aRow;
    uint8_t *ptrVideo;
    unsigned char aColByte, aColShift;
    unsigned char aBit;
    unsigned int auxOffs;

  //if (x>=0 && x<screenx && y>=0 && y<screeny)  
  //if (x>=0 && x<1024 && y>=0 && y<700)
    {
        // aRow= y;
        aColByte = x >> 3;          // x div 8
        aColShift = 7 - (x & 0x07); // x mod 8

        // gb_buffer_vga[y][x]= pixel;

