petersieg/ESP32TinyVectrex/ESP32/TinyVectrexJohnHawthorn/TinyVectrex/osint.cpp
        aBit = 1 << aColShift;
        // gb_buffer_vga[y][aColByte]= gb_buffer_vga[y][aColByte] | aBit;

        // uint8_t* gb_buffer_vga= VGAController.getScanline(y);
        auxOffs = aColByte;
        gb_buffer_vga[y][auxOffs] = gb_buffer_vga[y][auxOffs] | aBit;
        // ptrVideo = (uint8_t *)VGAController.sgetScanline(y);
        // ptrVideo[auxOffs]= ptrVideo[auxOffs] | aBit;
    }
}

#ifdef use_lib_wifi
static void draw_line_bresenham(short int x1, short int y1, short int x2, short int y2)
#else
static void IRAM_ATTR draw_line_bresenham(short int x1, short int y1, short int x2, short int y2)
#endif
{
    // bresenham line
    // int x1 = cord1.x, y1 = cord1.y,
    //    x2 = cord2.x, y2 = cord2.y,
    //    steep = fabs(y2 - y1) > fabs(x2 - x1),
    //    inc = -1;
    // int steep = fabs(y2 - y1) > fabs(x2 - x1);

    int topeY = VGAController.getViewPortHeight();
    int topeX = VGAController.getViewPortWidth();

    int steep = abs(y2 - y1) > abs(x2 - x1);
    int inc = -1;

    if (steep) {
        swap_short(&x1, &y1);
        swap_short(&x2, &y2);
    }

    if (x1 > x2) {
        swap_short(&x1, &x2);
        swap_short(&y1, &y2);
    }

    if (y1 < y2) {
        inc = 1;
    }

    //        int dx = fabs(x2 - x1),
    //            dy = fabs(y2 - y1),
    //            y = y1, x = x1,
    //            e = 0;
    // int dx = fabs(x2 - x1);
    // int dy = fabs(y2 - y1);
    int dx = abs(x2 - x1);
    int dy = abs(y2 - y1);
    int y = y1;
    int x = x1;
    int e = 0;

    for (x; x <= x2; x++) {
        if (steep) {
            // draw_pixel( y, x, 255);
            if (y >= 0 && y < topeX && x >= 0 && x < topeY) {
                draw_pixel_bresenham(y, x);
            } else {
                return;
            }
        } else {
            // draw_pixel( x, y, 255);
            if (x >= 0 && x < topeX && y >= 0 && y < topeY) {
                draw_pixel_bresenham(x, y);
            } else {
                return;
            }
        }

        if ((e + dy) << 1 < dx) {
            e = e + dy;
        } else {
            y += inc;
            e = e + dy - dx;
        }
    }
}
#endif

inline void drawdot(int x, int y) {
    DAC1Write(map(x, 0, _ALG_MAX_X, 0, 255));
    DAC2Write(map(_ALG_MAX_Y - y, 0, _ALG_MAX_Y, 0, 255));
}

#define drawskip 1
void drawline(int x1, int y1, int x2, int y2) {
    int x, y, xe, ye;
    int dx = x2 - x1;
    int dy = y2 - y1;
    int dx1 = labs(dx); // long abs
    int dy1 = labs(dy);
    int px = 2 * dy1 - dx1;
    int py = 2 * dx1 - dy1;
    if (dy1 <= dx1) {
        if (dx >= 0) {
            x = x1;
            y = y1;
            xe = x2;
        } else {
            x = x2;
            y = y2;
            xe = x1;
        }
        drawdot(x, y);
        // return;

        for (int i = 0; x < xe; i += drawskip) {
            x = x + 1;
            if (px < 0) {
                px = px + 2 * dy1;
            } else {
                if ((dx < 0 && dy < 0) || (dx > 0 && dy > 0)) {
                    y = y + 1;
                } else {
                    y = y - 1;
                }
                px = px + 2 * (dy1 - dx1);
            }
            drawdot(x, y);
        }
    } else {
        if (dy >= 0) {
            x = x1;
            y = y1;
            ye = y2;
        } else {
            x = x2;
            y = y2;
            ye = y1;
        }
        drawdot(x, y);

        for (int i = 0; y < ye; i += drawskip) {
            y = y + 1;
            if (py <= 0) {
                py = py + 2 * dx1;
            } else {
                if ((dx < 0 && dy < 0) || (dx > 0 && dy > 0)) {
                    x = x + 1;
                } else {
                    x = x - 1;
                }
                py = py + 2 * (dx1 - dy1);
            }
            drawdot(x, y);
        }
    }
}

void osint_render() {
    unsigned int vga_begin = micros();

    int x0, x1, y0, y1;
    DACPrepare(true);
    for (int v = 0; v < vector_draw_cnt; v++) {
        x0 = (int)(vectors_draw[v].x0);
        y0 = (int)(vectors_draw[v].y0);
        x1 = (int)(vectors_draw[v].x1);
        y1 = (int)(vectors_draw[v].y1);

        drawline(x0, y0, x1, y1);
    }

    DACUnprepare(true);
    // Serial.print(vector_draw_cnt / (millis() - t));
    // Serial.println(" Sa/s");
    drawdot(0, 0);

    unsigned int vga_end = micros();
    unsigned int time_prev = vga_end - vga_begin;
    gb_stats_video_cur_unified = time_prev;
    if (time_prev < gb_stats_video_min_unified) {
        gb_stats_video_min_unified = time_prev;
    }
    if (time_prev > gb_stats_video_max_unified) {
        gb_stats_video_max_unified = time_prev;
    }
}

void VGA_osint_render() {
    // Portar SDL_FillRect(screen, NULL, 0);
    int v;
    // unsigned int x0,x1,y0,y1;
    int x0, x1, y0, y1;
    unsigned int vga_begin, vga_end;

    vga_begin = micros();

    if (vector_draw_cnt <= 0) {
        vga_end = micros();
        unsigned int time_prev = vga_end - vga_begin;
        gb_stats_video_cur_unified = time_prev;
        if (time_prev < gb_stats_video_min_unified) {
            gb_stats_video_min_unified = time_prev;
        }
        if (time_prev > gb_stats_video_max_unified) {
            gb_stats_video_max_unified = time_prev;
        }
        return;
    }

#ifdef use_lib_gfx

#ifdef use_lib_remove_fabgl_queue
    Clear_bresenham();
#else
    Canvas cv(&VGAController);
    fabgl::Primitive p;
    Point auxPoint;

    // cv.setPenColor(Color::Black); //Borro pantalla SDL_FillRect
    // BEGIN setPenColor
    p.cmd = fabgl::PrimitiveCmd::SetPenColor;
    p.color = Color::Black;
    VGAController.addPrimitive(p);
    // END setPenColor

    // cv.setBrushColor(Color::Black); //Para el clear
    // BEGIN SetBrushColor
    p.cmd = fabgl::PrimitiveCmd::SetBrushColor;
    p.color = Color::Black;
    VGAController.addPrimitive(p);
    // END SetBrushColor

    // cv.clear();
    // Clear BEGIN
    p.cmd = fabgl::PrimitiveCmd::Clear;
    p.ivalue = 0;
    VGAController.addPrimitive(p);
    // Clear END

    // if (vector_draw_cnt > GetVECTOR_CNT())
    //{//Si supera los 1000 vectores lo muestra
    //  Serial.printf("vcnt:%d tope:%d\n",vector_draw_cnt,GetVECTOR_CNT());
    //  //fflush(stdout);
    // }
#endif

