petersieg/ESP32TinyVectrex/ESP32/TinyVectrexJohnHawthorn/TinyVectrex/osint.cpp
#ifdef use_lib_vectortiny
// cv.setPenColor(Color::White);
// BEGIN setPenColor
#ifdef use_lib_remove_fabgl_queue
#else
    p.cmd = fabgl::PrimitiveCmd::SetPenColor;
    p.color = Color::White;
    VGAController.addPrimitive(p);
    // END setPenColor
#endif

    for (v = 0; v < vector_draw_cnt; v++) {
        x0 = (int)(vectors_draw[v].x0);
        y0 = (int)(vectors_draw[v].y0);
        x1 = (int)(vectors_draw[v].x1);
        y1 = (int)(vectors_draw[v].y1);

        // printf("x,y:%d,%d x,y:%d,%d\n",x0,y0,x1,y1);
        // printf("x,y:%d,%d x,y:%d,%d\n",(x0/scl_factor),(y0/scl_factor),(x1/scl_factor),(y1/scl_factor));

        // x0= x0*100; //MULT 128
        // y0= y0*100;
        // x1= x1*100;
        // y1= y1*100;

        // scl_factor 85 640x480
        // scl_factor 68 800x600
        // scl_factor 53 1024x768
        if ((x0 == x1) && (y0 == y1)) { // Punto
            x0 = offx + x0 / scl_factor;
            y0 = offy + y0 / scl_factor;
// x1= offx + x1 / scl_factor;
// y1= offy + y1 / scl_factor;
// cv.setPixel(x0,y0,Color::White);
// BEGIN setPixel
#ifdef use_lib_remove_fabgl_queue
            // draw_line_bresenham(x0,y0,x0,x0);
            draw_pixel_bresenham(x0, y0);
#else
            p.cmd = fabgl::PrimitiveCmd::SetPixelAt;
            // auxPoint.X= x0;
            // auxPoint.Y= y0;
            auxPoint = {x0, y0};
            p.pixelDesc = {auxPoint, Color::White};
            VGAController.addPrimitive(p);
            // END setPixel
#endif

            // Portar    jj_aalineRGBA_tiny(screen,x0,y0,x1,y1);
            // cv.drawLine(x0, y0, x1, y1);
            // drawLine es moveTo y lineTo
            //   cv.moveTo(x0, y0);
            //   cv.lineTo(x1, y1);

        } else { // Linea
            x0 = offx + x0 / scl_factor;
            y0 = offy + y0 / scl_factor;
            x1 = offx + x1 / scl_factor;
            y1 = offy + y1 / scl_factor;
#ifdef use_lib_remove_fabgl_queue
            draw_line_bresenham(x0, y0, x1, y1);
#else
            // BEGIN moveTo
            p.cmd = fabgl::PrimitiveCmd::MoveTo;
            p.position = Point(x0, y0);
            VGAController.addPrimitive(p);
            // End moveTo

            // Begin lineTo
            // Primitive p;
            p.cmd = fabgl::PrimitiveCmd::LineTo;
            p.position = Point(x1, y1);
            VGAController.addPrimitive(p);
            // End lineTo
#endif
        }
    }

#ifdef use_lib_remove_fabgl_queue
#else
    VGAController.processPrimitives();
#endif

    vga_end = micros();
    unsigned int time_prev = vga_end - vga_begin;
    gb_stats_video_cur_unified = time_prev;
    if (time_prev < gb_stats_video_min_unified) {
        gb_stats_video_min_unified = time_prev;
    }
    if (time_prev > gb_stats_video_max_unified) {
        gb_stats_video_max_unified = time_prev;
    }
    // Serial.printf("vga %d\n",(vga_end-vga_begin));
    // fflush(stdout);
#else
    // printf("vcnt:%d\n",vector_draw_cnt);
    // fflush(stdout);
    for (v = 0; v < vector_draw_cnt; v++) {
        Uint8 c = vectors_draw[v].color * 256 / VECTREX_COLORS;
        // JJ		aalineRGBA(screen,
        // JJ				offx + vectors_draw[v].x0 / scl_factor,
        // JJ        offy + vectors_draw[v].y0 / scl_factor,
        // JJ				offx + vectors_draw[v].x1 / scl_factor,
        // JJ        offy + vectors_draw[v].y1 / scl_factor,
        // JJ				c, c, c, 0xff);

        // int x0=(vectors_draw[v].x0*7)/1024, x1=(vectors_draw[v].x1*7)/1024,
        // y0=((vectors_draw[v].y0/128-32)*900)/1024, y1=((vectors_draw[v].y1/128-32)*900)/1024; sline(  x0,y0,x1,y1,
        // c);

        x0 = vectors_draw[v].x0;
        y0 = vectors_draw[v].y0;
        x1 = vectors_draw[v].x1;
        y1 = vectors_draw[v].y1;
        // if (c!=254)
        //{
        //  printf("Color:%d\n",c);
        //  fflush(stdout);
        // }

        jj_aalineRGBA(screen, (offx + x0 / scl_factor), (offy + y0 / scl_factor), (offx + x1 / scl_factor),
                      (offy + y1 / scl_factor), c, c, c, 0xff);

        //	jj_aalineRGBA(screen,
        //				  (int)((float)offx + (float)x0 / (float)scl_factor_float),
        //                  (int)((float)offy + (float)y0 / (float)scl_factor_float),
        //		  		  (int)((float)offx + (float)x1 / (float)scl_factor_float),
        //                  (int)((float)offy + (float)y1 / (float)scl_factor_float),
        //				c, c, c, 0xff);

        // printf("x0:%d y0:%d x1:%d y1:%d\n", x0,y0,x1,y1);
    }
#endif

#endif

    // Portar SDL_Flip(screen);
}

static char *romfilename = "rom.dat";
// static char *romfilename = "OnslaughtElectronBeamPlayboys.bin";
// static char *romfilename = "rainy.bin";
static char *cartfilename = NULL;
// static char *cartfilename = "rainy.bin";

#ifdef use_lib_wifi
// void load_cart_WIFI(char * cadUrl)
void load_cart_WIFI() {
    int auxFileSize = 0;

    // if (strcmp(cadUrl,"")==0)
    if (strcmp(gb_cadUrl, "") == 0) {
#ifdef use_lib_wifi_debug
        Serial.printf("cart name empty\n");
#endif
        return;
    }

#ifdef use_lib_wifi_debug
    Serial.printf("load_cart_WIFI\n");
#endif
#ifdef use_lib_wifi_debug
    Serial.printf("Check WIFI\n");
#endif
    if (Check_WIFI() == false) {
        return;
    }
    int leidos = 0;
#ifdef use_lib_wifi_debug
    // Serial.printf("URL:%s\n",cadUrl);
    Serial.printf("URL:%s\n", gb_cadUrl);
#endif
    // Asignar_URL_stream_WIFI(cadUrl);
    Asignar_URL_stream_WIFI(gb_cadUrl);
    auxFileSize = gb_size_file_wifi;
#ifdef use_lib_wifi_debug
    Serial.printf("Size cart:%d\n", gb_size_file_wifi);
#endif
    Leer_url_stream_WIFI(&leidos);
#ifdef use_lib_wifi_debug
    Serial.printf("Leidos:%d\n", leidos); // Leemos 1024 bytes
#endif

    // He leido 1024 bytes. Lee resto
    int contBuffer = 0;
    int cont1024 = 0;
    while (contBuffer < auxFileSize) {
        if (contBuffer >= sizeof(cart)) {
#ifdef use_lib_wifi_debug
            Serial.printf("Limit exced cart 32768\n");
#endif
            break;
        }
        cart[contBuffer] = gb_buffer_wifi[cont1024];
        contBuffer++;

        cont1024++;
        if (cont1024 >= 1024) {
            Leer_url_stream_WIFI(&leidos);
#ifdef use_lib_wifi_debug
            Serial.printf("Leidos:%d\n", leidos);
#endif
            cont1024 = 0;
        }
    }
}
#endif

