petersieg/ESP32TinyVectrex/ESP32/TinyVectrexJohnHawthorn/TinyVectrex/osint.cpp
static void initLoadROM() {
#ifdef use_lib_rom_no_use_ram
#ifdef use_lib_log_serial
    Serial.printf("Load rom FLASH\n");
#endif
    // fflush(stdout);
    rom = gb_rom_bios;
#else
    memcpy(rom, gb_rom_bios, 8192);
    //	FILE *f;
    //	if(!(f = fopen(romfilename, "rb"))){
    //		perror(romfilename);
    //		printf("ERROR load rom\n");
    //		//fflush(stdout);
    //		exit(EXIT_FAILURE);
    //	}
    // printf("Load rom %s\n",romfilename);
    // fflush(stdout);
    //	if(fread(rom, 1, sizeof (rom), f) != sizeof (rom)){
    //		printf("Invalid rom length\n");
    //		//fflush(stdout);
    //		exit(EXIT_FAILURE);
    //	}
    //	fclose(f);
#endif

#ifdef use_lib_cartdridge_no_use_ram
#else
    memset(cart, 0, sizeof(cart));
#endif

#ifdef use_lib_cartdridge_flash_ram
#ifdef use_lib_log_serial
#ifdef use_lib_wifi
    Serial.printf("Load cartdridge FLASH WIFI id:%d name:%s\n", gb_id_cur_rom, gb_cadUrl);
#else
    Serial.printf("Load cartdridge FLASH id:%d size:%d\n", gb_id_cur_rom, gb_list_cart_size[gb_id_cur_rom]);
#endif
#endif

#ifdef use_lib_wifi
#else
    int topeCartBytes;
    if (gb_list_cart_size[gb_id_cur_rom] < 32768) {
        topeCartBytes = gb_list_cart_size[gb_id_cur_rom];
    } else {
        topeCartBytes = 32768;
#ifdef use_lib_log_serial
        Serial.printf("Excede tamanio Cartucho 32768 bytes\n");
#endif
    }
#endif

#ifdef use_lib_cartdridge_no_use_ram
    cart = gb_list_rom_data[gb_id_cur_rom];
#else
#ifdef use_lib_wifi
    ShowStatusWIFI(1);
    load_cart_WIFI(); // uso gb_cadUrl
    ShowStatusWIFI(0);
#else
    memcpy(cart, gb_list_rom_data[gb_id_cur_rom], topeCartBytes);
#endif
#endif

#else
    if (cartfilename) {
        FILE *f;
        if (!(f = fopen(cartfilename, "rb"))) {
            perror(cartfilename);
            printf("Invalid cart\n");
            // fflush(stdout);
            exit(EXIT_FAILURE);
        }
        printf("Load cartdridge %s\n", cartfilename);
        // fflush(stdout);
        fread(cart, 1, sizeof(cart), f);
        fclose(f);
    }
#endif
}

// void resize(int width, int height) {
// #ifdef use_lib_vectortiny
//     int sclx, scly;
// #else
//     long sclx, scly;
// #endif
//     float float_sclx, float_scly;
//
//     screenx = width;
//     screeny = height;
//     // JJ screen = SDL_SetVideoMode(screenx, screeny, 0, SDL_SWSURFACE | SDL_RESIZABLE);
//     // Portar 	screen = SDL_SetVideoMode(screenx, screeny, 8, SDL_SWSURFACE | SDL_RESIZABLE);
//     // Portar 	SDL_WM_SetCaption ("SDL Port ESP32 Vectrex", NULL);
//     // Portar 	PreparaPaleta();
//     // Portar 	SDL_SetPalette(screen,SDL_LOGPAL|SDL_PHYSPAL, gb_colors, 0, 256);
//     // Portar 	SDLAssignSDLSurfaceOSD(screen,&gb_event);//Asignamos surface
//
//     // Portar 	sclx = ALG_MAX_X / screen->w;
//     // Portar 	scly = ALG_MAX_Y / screen->h;
//
//     // 	sclx = ALG_MAX_X / 640;
//     // 	scly = ALG_MAX_Y / 480;
//
//     sclx = ALG_MAX_X / width;
//     scly = ALG_MAX_Y / height;
//
//     // float_sclx = (float)ALG_MAX_X / (float)screen->w;
//     // float_scly = (float)ALG_MAX_Y / (float)screen->h;
//
//     scl_factor = sclx > scly ? sclx : scly;
//     // scl_factor_float= float_sclx > float_scly ? float_sclx : float_scly;
//
//     offx = (screenx - ALG_MAX_X / scl_factor) / 2;
//     offy = (screeny - ALG_MAX_Y / scl_factor) / 2;
//
//     // offx = (int)(screenx - ALG_MAX_X / scl_factor_float) / 2;
//     // offy = (int)(screeny - ALG_MAX_Y / scl_factor_float) / 2;
// }

static void readevents() {

    if (checkAndCleanKey(KEY_F1)) {
        gb_show_osd_main_menu = 1;
        // Serial.printf("Tecla F1 Menu OSD\n");
        do_tinyOSD();
    }


    if (digitalRead(b1)==0){
        //Serial.print("B1 Down");
        snd_regs[14] &= ~0x01;
    }
    else{
        //Serial.print("B1 Up");
        snd_regs[14] |= 0x01;
    }

    if (digitalRead(b2)==0){
        //Serial.print("B2 Down");
        snd_regs[14] &= ~0x02;
    }
    else
        snd_regs[14] |= 0x02;

    if (digitalRead(b3)==0)
        snd_regs[14] &= ~0x04;
    else
        snd_regs[14] |= 0x04;

    if (digitalRead(b4)==0)
        snd_regs[14] &= ~0x08;
    else
        snd_regs[14] |= 0x08;



    if (digitalRead(CuL)==0) {
        //Serial.print("Left");
        alg_jch0 = 0x00;
    } else {
        alg_jch0 = 0x80;
    }

    if (digitalRead(CuR)==0) {
        //Serial.print("Right");
        alg_jch0 = 0xff;
    } else {
        //alg_jch0 = 0x80;
    }

    if (digitalRead(CuU)==0) {
        alg_jch1 = 0xff;
    } else {
        alg_jch1 = 0x80;
    }

    if (digitalRead(CuD)==0) {
        alg_jch1 = 0x00;
    } else {
        // alg_jch1 = 0x80;
    }


    /*if (keymap[PS2_KC_A] == 0) {
        snd_regs[14] &= ~0x01;
    } else {
        snd_regs[14] |= 0x01;
    }

    if (keymap[PS2_KC_S] == 0) {
        snd_regs[14] &= ~0x02;
    } else {
        snd_regs[14] |= 0x02;
    }

    if (keymap[PS2_KC_D] == 0) {
        snd_regs[14] &= ~0x04;
    } else {
        snd_regs[14] |= 0x04;
    }

    if (keymap[PS2_KC_F] == 0) {
        snd_regs[14] &= ~0x08;
    } else {
        snd_regs[14] |= 0x08;
    }

    if (keymap[KEY_CURSOR_LEFT] == 0) {
        alg_jch0 = 0x00;
    } else {
        alg_jch0 = 0x80;
    }

    if (keymap[KEY_CURSOR_RIGHT] == 0) {
        alg_jch0 = 0xff;
    } else {
        // alg_jch0 = 0x80;
    }

    if (keymap[KEY_CURSOR_UP] == 0) {
        alg_jch1 = 0xff;
    } else {
        alg_jch1 = 0x80;
    }

    if (keymap[KEY_CURSOR_DOWN] == 0) {
        alg_jch1 = 0x00;
    } else {
        // alg_jch1 = 0x80;
    }*/

    /*
     auto keyboard = PS2Controller.keyboard();
     if (keyboard->isKeyboardAvailable())
     {
      if (keyboard->isVKDown(fabgl::VK_F1)){
       gb_show_osd_main_menu=1;
       //Serial.printf("Tecla F1 Menu OSD\n");
       do_tinyOSD();
      }

      if (keyboard->isVKDown(fabgl::VK_a)){
       snd_regs[14] &= ~0x01;
      }
      else{
       snd_regs[14]|= 0x01;
      }

      if (keyboard->isVKDown(fabgl::VK_s)){
       snd_regs[14] &= ~0x02;
      }
      else{
       snd_regs[14]|= 0x02;
      }

      if (keyboard->isVKDown(fabgl::VK_d)){
       snd_regs[14] &= ~0x04;
      }
      else{
       snd_regs[14]|= 0x04;
      }

      if (keyboard->isVKDown(fabgl::VK_f)){
       snd_regs[14] &= ~0x08;
      }
      else{
       snd_regs[14]|= 0x08;
      }

      if (keyboard->isVKDown(fabgl::VK_LEFT)){
       alg_jch0 = 0x00;
      }
      else{
       alg_jch0 = 0x80;
      }

      if (keyboard->isVKDown(fabgl::VK_RIGHT)){
       alg_jch0 = 0xff;
      }
      else{
       alg_jch0 = 0x80;
      }

      if (keyboard->isVKDown(fabgl::VK_UP)){
       alg_jch1 = 0xff;
      }
      else{
       alg_jch1 = 0x80;
      }

      if (keyboard->isVKDown(fabgl::VK_DOWN)){
       alg_jch1 = 0x00;
      }
      else{
       alg_jch1 = 0x80;
      }
     }
    */

    /*Portar

        //JJ SDL_Event e;
        while(SDL_PollEvent(&gb_event)){
            switch(gb_event.type){
                case SDL_QUIT:
                    exit(0);
                    break;
          case SDL_VIDEORESIZE:
            resize(gb_event.resize.w, gb_event.resize.h);
            break;
                case SDL_KEYDOWN:
                    switch(gb_event.key.keysym.sym){
                        case SDLK_F1:
                         gb_show_osd_main_menu=1;
                         printf("Tecla F1 Menu OSD\n");
                         //fflush(stdout);
                         do_tinyOSD();
                         break;
                        case SDLK_ESCAPE:
                            gb_salir=1;
                            exit(0);
                        case SDLK_a:
                            snd_regs[14] &= ~0x01;
                            break;
                        case SDLK_s:
                            snd_regs[14] &= ~0x02;
                            break;
                        case SDLK_d:
                            snd_regs[14] &= ~0x04;
                            break;
                        case SDLK_f:
                            snd_regs[14] &= ~0x08;
                            break;
                        case SDLK_LEFT:
                            alg_jch0 = 0x00;
                            break;
                        case SDLK_RIGHT:
                            alg_jch0 = 0xff;
                            break;
                        case SDLK_UP:
                            alg_jch1 = 0xff;
                            break;
                        case SDLK_DOWN:
                            alg_jch1 = 0x00;
                            break;
              default:
                break;
                    }
                    break;
                case SDL_KEYUP:
                    switch(gb_event.key.keysym.sym){
                        case SDLK_a:
                            snd_regs[14] |= 0x01;
                            break;
                        case SDLK_s:
                            snd_regs[14] |= 0x02;
                            break;
                        case SDLK_d:
                            snd_regs[14] |= 0x04;
                            break;
                        case SDLK_f:
                            snd_regs[14] |= 0x08;
                            break;
                        case SDLK_LEFT:
                            alg_jch0 = 0x80;
                            break;
                        case SDLK_RIGHT:
                            alg_jch0 = 0x80;
                            break;
                        case SDLK_UP:
                            alg_jch1 = 0x80;
                            break;
                        case SDLK_DOWN:
                            alg_jch1 = 0x80;
                            break;
              default:
                break;
                    }
                    break;
          default:
            break;
            }
        }
    */
}

void osint_emuloop() {
    unsigned long cpu_begin, cpu_end;
    // Portar 	Uint32 next_time = SDL_GetTicks() + EMU_TIMER;
    unsigned int next_time = millis() + EMU_TIMER;

