petersieg/ESP32TinyVectrex/ESP32/TinyVectrexJohnHawthorn/TinyVectrex/osint.cpp
    vecx_reset();

    for (;;) {
        if (gb_load_new_rom == 1) {
            break;
        }

        cpu_begin = micros();
        vecx_emu((VECTREX_MHZ / 1000) * EMU_TIMER, 0);
        cpu_end = micros();
        gb_fps_unified++;
        gb_stats_time_cur_unified = (cpu_end - cpu_begin);
        if (gb_stats_time_cur_unified < gb_stats_time_min_unified)
            gb_stats_time_min_unified = gb_stats_time_cur_unified;
        if (gb_stats_time_cur_unified > gb_stats_time_max_unified)
            gb_stats_time_max_unified = gb_stats_time_cur_unified;

        readevents();

        // Serial.printf("%d %d %d\n",cpu_end,cpu_begin,(cpu_end-cpu_begin));
        // Serial.printf("%d\n",(cpu_end-cpu_begin));
        gb_currentTime = millis();
        if ((gb_currentTime - gb_fps_time_ini_unified) > 1000) {
            gb_fps_time_ini_unified = gb_currentTime;
            unsigned int aux_fps = gb_fps_unified - gb_fps_ini_unified;
            gb_fps_ini_unified = gb_fps_unified;
#ifdef use_lib_log_serial
            Serial.printf("fps:%d\n", aux_fps);
            //Serial.printf("fps:%d %d m:%d mx:%d v %d m:%d mx:%d\n", aux_fps, gb_stats_time_cur_unified,
            //              gb_stats_time_min_unified, gb_stats_time_max_unified, gb_stats_video_cur_unified,
            //              gb_stats_video_min_unified, gb_stats_video_max_unified);
#endif
            gb_stats_time_min_unified = 500000;
            gb_stats_time_max_unified = 0;
            gb_stats_video_min_unified = 500000;
            gb_stats_video_max_unified = 0;
        }

        //		{
        // Portar 			Uint32 now = SDL_GetTicks();
        unsigned int now = millis();
        if (now < next_time) {
            // Portar 				SDL_Delay(next_time - now);
        } else {
            next_time = now;
        }
        next_time += EMU_TIMER;
        //		}
    }
}

//********************************
void ImprimeMemoria() {
#ifdef use_lib_log_serial
    Serial.printf("VECTREX_MHZ:%d\n", VECTREX_MHZ);
    Serial.printf("VECTREX_PDECAY:%d\n", GetVECTREX_PDECAY());
    Serial.printf("VECTOR_CNT:%d\n", GetVECTOR_CNT());
    Serial.printf("vectors_set:%d bytes\n", GetSizeBytes_vectors_set());
    Serial.printf("VECTOR_HASH:%d\n", GetVECTOR_HASH());
    Serial.printf("vector_hash:%d bytes\n", GetSizeBytes_vector_hash());
#endif
    // fflush(stdout);
}

//********************************
// int main(int argc, char *argv[])
int mainEmulator() {
    ImprimeMemoria();

    DACInit();

    // Portar   SDL_Init(SDL_INIT_VIDEO);

// JJ resize(330*3/2, 410*3/2);
// resize(320,200);
// #ifdef use_lib_vga640x480
//     resize(640, 480); // se ve bien
// #else
// #ifdef use_lib_vga800x600
//     resize(800, 600);
// #else
// #ifdef use_lib_vga1024x768
//     resize(1024, 768); // Se ve perfecto
// #endif
// #endif
// #endif

// resize(360,480);
// resize(360,240);
#ifdef use_lib_log_serial
    Serial.printf("Sizeof long:%d\n", sizeof(long));
    Serial.printf("screenx:%d screeny:%d\n", screenx, screeny);
#endif

    // Portar   if(argc > 1)
    // Portar   {
    // Portar    cartfilename = argv[1];
    // Portar   }

    while (gb_salir == 0) {
        if (gb_load_new_rom == 1) {
            // cartfilename= gb_cartfilename;
            gb_load_new_rom = 0;
            initLoadROM(); // Cambio de init que lo usa fabgl
            osint_emuloop();
        }
    }

    return 0;
}
